app/Controllers/Admin.php

SELECT `employes`.*, `departements`.`nom` AS `departement_nom`
FROM `employes`
LEFT JOIN `departements` ON `departements`.`id` = `employes`.`departement_id`
ORDER BY `employes`.`id` DESC
SELECT *
FROM `types_conge`
ORDER BY `libelle` ASC
---
    public function employes()
    {
        $departementModel = new Departements();
        $employeModel = new Employes();
        $typeCongeModel = new TypeConge();

        $data = [
            'departements' => $departementModel->orderBy('nom', 'ASC')->findAll(),
            'employes' => $employeModel
                ->select('employes.*, departements.nom AS departement_nom')
                ->join('departements', 'departements.id = employes.departement_id', 'left')
                ->orderBy('employes.id', 'DESC')
                ->findAll(),
            'typesConge' => $typeCongeModel->orderBy('libelle', 'ASC')->findAll(),