app/Controllers/Employe.php

SELECT *
FROM `conges`
---
    public function getAllConge() {

        // Si tu as aussi besoin de l'historique des demandes de l'employé sur la page :
        $data["Conges"] = $this->Conges->findAll();

SELECT COUNT(*) AS `numrows`
FROM `conges`
---
    public function CountConge() {
        // Compteur du nombre de conges
        $data["Nb_conge"]= (int)$this->Conges->countAllResults();

INSERT INTO `conges` (`employe_id`, `type_conge_id`, `date_debut`, `date_fin`, `nb_jours`, `motif`, `statut`, `commentaire_rh`, `created_at`, `traiter_par`) VALUES (NULL, NULL, NULL, NULL, '5', 'test', 'En attente', NULL, NULL, NULL)
---
    public function storeConge() {
        $data = $this->getCongeFormData();
        $this->Conges->insert($data);