app/Controllers/Home.php

SELECT *
FROM `employes`
WHERE `email` = 'employe@techmadamg'
AND `password` = 'emp123'
 LIMIT 1
---
    public function login()
    {
        $email = (string) $this->request->getPost('email');
        $password = (string) $this->request->getPost('password');

        $employe = $this->Employes->where('email', $email)
                       ->where('password', $password)
                       ->first();