app/Controllers/RessourceH.php

SELECT *
FROM `conges`
WHERE `statut` = 'En attente'
---
    public function getAllCongeAttente() {

        $data['CongeAttente']= $this->Conges->where('statut', 'En attente')->findAll();